Tekla Open API Reference for Tekla Structures 2025
SymbolElement Constructor (SymbolInfo, TeklaDrawingColor, Double)
 Creates a new symbol element instance with the given symbol, the RGB color and height.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SymbolElement(
	SymbolInfo Symbol,
	TeklaDrawingColor Color,
	double Height
)
Public Sub New (
	Symbol As SymbolInfo,
	Color As TeklaDrawingColor,
	Height As Double
)
Parameters
Symbol
Type: Tekla.Structures.Drawing.SymbolInfo
The symbol to be used.
Color
Type: Tekla.Structures.Drawing.TeklaDrawingColor
The symbol color to be used as a true RGB color.
Height
Type: System.Double
The symbol height (mm) to be used.
See Also
Reference
SymbolElement Class
SymbolElement Overload
Tekla.Structures.Drawing Namespace